artillery-tests/reports/house-no-caching-1get.txt
--------------------------------
Summary report @ 15:14:17(+0000)
--------------------------------

http.codes.201: ................................................................ 130
http.codes.202: ................................................................ 130
http.codes.204: ................................................................ 130
http.downloaded_bytes: ......................................................... 28730
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 390
http.response_time:
  min: ......................................................................... 49
  max: ......................................................................... 2213
  median: ...................................................................... 63.4
  p95: ......................................................................... 314.2
  p99: ......................................................................... 478.3
http.responses: ................................................................ 390
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 130
plugins.metrics-by-endpoint.GET /house/:houseID.codes.202: ..................... 130
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 130
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 53
  max: ......................................................................... 477
  median: ...................................................................... 77.5
  p95: ......................................................................... 314.2
  p99: ......................................................................... 450.4
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 49
  max: ......................................................................... 838
  median: ...................................................................... 57.4
  p95: ......................................................................... 340.4
  p99: ......................................................................... 441.5
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 55
  max: ......................................................................... 2213
  median: ...................................................................... 63.4
  p95: ......................................................................... 257.3
  p99: ......................................................................... 561.2
vusers.completed: .............................................................. 130
vusers.created: ................................................................ 130
vusers.created_by_name.House Flow: ............................................. 130
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 313.5
  max: ......................................................................... 3204.4
  median: ...................................................................... 528.6
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1755