artillery-tests/reports/house-no-caching-20get.txt
--------------------------------
Summary report @ 15:27:02(+0000)
--------------------------------

http.codes.201: ................................................................ 130
http.codes.202: ................................................................ 2600
http.codes.204: ................................................................ 130
http.downloaded_bytes: ......................................................... 574600
http.request_rate: ............................................................. 80/sec
http.requests: ................................................................. 2860
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2192
  median: ...................................................................... 67.4
  p95: ......................................................................... 284.3
  p99: ......................................................................... 468.8
http.responses: ................................................................ 2860
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 130
plugins.metrics-by-endpoint.GET /house/:houseID.codes.202: ..................... 2600
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 130
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 38
  max: ......................................................................... 485
  median: ...................................................................... 76
  p95: ......................................................................... 290.1
  p99: ......................................................................... 459.5
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 0
  max: ......................................................................... 829
  median: ...................................................................... 67.4
  p95: ......................................................................... 278.7
  p99: ......................................................................... 459.5
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 35
  max: ......................................................................... 2192
  median: ...................................................................... 74.4
  p95: ......................................................................... 450.4
  p99: ......................................................................... 658.6
vusers.completed: .............................................................. 130
vusers.created: ................................................................ 130
vusers.created_by_name.House Flow: ............................................. 130
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2204.3
  max: ......................................................................... 5244.7
  median: ...................................................................... 2671
  p95: ......................................................................... 3752.7
  p99: ......................................................................... 3905.8