artillery-tests/reports/house-no-caching-30get.txt
--------------------------------
Summary report @ 14:42:30(+0000)
--------------------------------

http.codes.200: ................................................................ 190
http.codes.201: ................................................................ 190
http.codes.202: ................................................................ 2850
http.codes.204: ................................................................ 95
http.downloaded_bytes: ......................................................... 558600
http.request_rate: ............................................................. 95/sec
http.requests: ................................................................. 3325
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 3288
  median: ...................................................................... 247.2
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 2101.1
http.responses: ................................................................ 3325
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 95
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 95
plugins.metrics-by-endpoint.GET /house/:houseID.codes.202: ..................... 2850
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 95
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 95
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 95
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 41
  max: ......................................................................... 3288
  median: ...................................................................... 295.9
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 2566.3
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 26
  max: ......................................................................... 1245
  median: ...................................................................... 122.7
  p95: ......................................................................... 528.6
  p99: ......................................................................... 1043.3
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 0
  max: ......................................................................... 2772
  median: ...................................................................... 257.3
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 2101.1
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 56
  max: ......................................................................... 2756
  median: ...................................................................... 273.2
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2725
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 53
  max: ......................................................................... 1610
  median: ...................................................................... 198.4
  p95: ......................................................................... 632.8
  p99: ......................................................................... 1153.1
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 35
  max: ......................................................................... 642
  median: ...................................................................... 147
  p95: ......................................................................... 441.5
  p99: ......................................................................... 528.6
vusers.completed: .............................................................. 95
vusers.created: ................................................................ 95
vusers.created_by_name.House Flow: ............................................. 95
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3059.3
  max: ......................................................................... 20684.2
  median: ...................................................................... 14621.8
  p95: ......................................................................... 18963.6
  p99: ......................................................................... 20543.1